{
  "home": {
    "Homejs": {
      "greeting": "Bonjour!",
      "introduction1": "JE SUIS",
      "introduction2": "TAREK CHAALAN",
      "developer": "Développeur",
      "letMeIntroduce1": "LAISSEZ-MOI",
      "letMeIntroduce2": "ME",
      "letMeIntroduce3": "PRÉSENTER",
      "summary": "J'ai commencé à programmer quand j'avais 12 ans et maintenant cela fait un peu plus de 9 ans depuis. J'ai une bonne maîtrise de plusieurs",
      "summary2": "langages et technologies de programmation.",
      "summary3": "Je suis toujours prêt à apprendre et à travailler à travers les technologies et domaines, pour élargir mes connaissances et créer plus d'opportunités. J'aime explorer de nouvelles technologies et les utiliser pour résoudre des problèmes du monde réel.",
      "fluency1": "Je suis fluide dans les classiques comme",
      "languages": "Python, Javascript, C++, HTML et CSS.",
      "Interests": "Mon domaine d'intérêt est de construire de nouvelles",
      "Interests2": "Technologies Web et Produits",
      "Interests3": "et aussi dans des domaines liés à",
      "Interests4": "la Cybersécurité et l'Intelligence Artificielle.",
      "developwith": "Chaque fois que possible, j'applique également ma passion pour développer des produits avec",
      "developwith2": "Node.js",
      "developwith3": "et",
      "developwith4": "Bibliothèques & Frameworks Javascript Modernes",
      "developwith5": "comme",
      "developwith6": "React.js et Next.js",
      "connect": "CONTACT",
      "connectWithMe": "N'hésitez pas à",
      "connectWithMe2": "me contacter",
      "connectWithMe3": ""
    },
    "Typejs": {
      "string1": "Logiciel",
      "string2": "Full Stack",
      "string3": "Front End",
      "string4": "Back End"
    }
  },
  "about": {
    "Aboutjs": {
      "aboutMeIntro": "Savoir Qui",
      "aboutMeIntro2": "JE SUIS",
      "skillset1": "Compétences",
      "skillset2": "Professionnelles",
      "tools1": "Outils",
      "tools2": "que j'utilise"
    },
    "AboutCardjs": {
      "aboutMe1": "Bonjour à tous, je suis",
      "aboutMe2": "Tarek Chaalan",
      "aboutMe3": "de",
      "aboutMe4": "Long Beach, Californie",
      "aboutMe5": "J'ai grandi au",
      "aboutMe6": "Koweït",
      "aboutMe7": ", mais je suis né à",
      "aboutMe8": "Beyrouth, Liban",
      "period": ".",
      "aboutMe9": "Je viens de terminer mes études à",
      "aboutMe10": "CSUF",
      "aboutMe11": "avec l'intention d'obtenir mon diplôme en",
      "aboutMe12": "Août 2024",
      "activities1": "En dehors du codage, voici quelques autres activités que j'aime faire :",
      "activities2": "Basket-ball",
      "activities3": "Jeux vidéo",
      "activities4": "Musique"
    }
  },
  "projects": {
    "Projectsjs": {
      "projects": "Mes Récentes",
      "projects2": "Réalisations",
      "projects3": "Voici quelques projets sur lesquels j'ai travaillé récemment.",
      "card1Description": "Ce portfolio, qui a été développé en utilisant JavaScript avec le framework React, montre des compétences de développement web modernes avec un accent aigu sur le style CSS et l'UX, réactif sur tous les types d'appareils. Il présente des informations personnelles détaillées, des compétences, des projets et des détails de CV, reflétant tout ce sur quoi j'ai travaillé, en le mettant continuellement à jour au fur et à mesure. Node.js est utilisé pour une gestion efficace des dépendances, et les composants personnalisés mettent en évidence une excellente approche d'un design interactif.",
      "card2Description": "FitFuel, une application innovante, intègre la planification des repas et des entraînements avec l'IA et une connectivité robuste aux applications de santé, facilitant un parcours de bien-être complet. Conçu pour offrir des plans personnalisés, il comble un vide critique sur le marché en ciblant les utilisateurs et les professionnels soucieux de leur santé. Il se concentre sur la sécurité des données et encourage les retours continus pour atteindre un style de vie équilibré. Le planificateur s'adapte aux besoins individuels, rendant la gestion de la santé à la fois accessible et engageante.",
      "card3Description": "Chess vs GPT est un jeu d'échecs en ligne sécurisé qui vous permet de défier les modèles GPT d'OpenAI dans une interface réactive. Vous pouvez choisir parmi plusieurs modèles d'IA (GPT-4.5, GPT-4 Turbo, GPT-4, GPT-3.5 Turbo) pour différents niveaux de difficulté. Le jeu propose une validation des coups en temps réel, la détection des coups illégaux, des effets sonores immersifs et une gestion sécurisée des clés API avec un chiffrement côté client. Il utilise chessboard.js pour l'échiquier interactif et chess.js pour la validation des coups, assurant une expérience fluide, équitable et sécurisée. Jouez, annulez des coups, retournez l'échiquier et profitez d'une expérience d'échecs moderne !",
      "card4Description": "Un système moderne de gestion de barbier incluant la réservation de rendez-vous et le commerce électronique dans une interface responsive. Comprend une planification en temps réel avec paiements Stripe, une boutique de produits avec panier d'achat et un tableau de bord administratif sécurisé. Construit avec Firebase, il démontre une expertise en authentification utilisateur, gestion de base de données et paiements sécurisés. Le design épuré assure une expérience fluide sur tous les appareils pour les clients comme pour les propriétaires.",
      "card5Description": "Cette application Tic Tac Toe, construite avec React, offre une expérience nostalgique avec son fond tableau noir et sa police semblable à de la craie. Jouez contre un ami ou défiez l'ordinateur, qui utilise l'algorithme Minimax pour déterminer le meilleur coup, le rendant difficile à battre (il serait plus précis de dire 'impossible à battre'). Avec des clics faciles pour placer vos marques et un tableau de score représenté par des bâtons pour garder la trace, c'est une façon amusante de tester vos compétences. Que vous jouiez avec des amis ou seul, c'est un excellent moyen de passer le temps.",
      "card6Description": "Ce site Web est encore en développement ! Restez à l'écoute !"
    },
    "Githubjs": {
      "github": "Jours où je",
      "github2": "Code"
    }
  },
  "resume": {
    "Resumejs": {
      "Download": "Télécharger le CV",
      "Toggle": "Changer le Thème"
    }
  },
  "contact": {
    "Contactjs": {
      "header": "Contactez-moi",
      "name": "Nom",
      "phone": "Numéro de Téléphone",
      "email": "Adresse Email",
      "message": "Message",
      "submit": "Envoyer"
    }
  },
  "navbar": {
    "Navbarjs": {
      "Home": "Accueil",
      "About": "À Propos",
      "Projects": "Projets",
      "Resume": "CV",
      "Contact": "Contact"
    }
  }
}
